export const dates:Array<TPoint> = [
    {
        text: 'Наука',
        startingDate: 2015,
        endingDate: 2022,
        dates: [
            {
                date: 2015,
                text: '13 сентября — частное солнечное затмение,видимое в Южной Африке и части Антарктиды'
            },
            {
                date: 2016,
                text: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11',
            },
            {
                date: 2017,
                text: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi'
            },
            {
                date: 2015,
                text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
            },
            {
                date: 2016,
                text: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11',
            },
            {
                date: 2017,
                text: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi'
            }
        ]
    },
    {
        text: 'Кино',
        startingDate: 2022,
        endingDate: 2024,
        dates: [
            {
                date: 2022,
                text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
            },
            {
                date: 2023,
                text: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11',
            },
            {
                date: 2023,
                text: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi'
            },
            {
                date: 2024,
                text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
            },
            {
                date: 2024,
                text: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11',
            },
            {
                date: 2024,
                text: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi'
            }
        ]
    },
    {
        text: 'Кино2',
        startingDate: 2015,
        endingDate: 2022,
        dates: [
            {
                date: 2015,
                text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
            },
            {
                date: 2016,
                text: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11',
            },
            {
                date: 2017,
                text: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi'
            },
            {
                date: 2015,
                text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
            },
            {
                date: 2016,
                text: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11',
            },
            {
                date: 2017,
                text: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi'
            }
        ]
    },
    {
        text: 'Наука2',
        startingDate: 2015,
        endingDate: 2022,
        dates: [
            {
                date: 2015,
                text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
            },
            {
                date: 2016,
                text: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11',
            },
            {
                date: 2017,
                text: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi'
            },
            {
                date: 2015,
                text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
            },
            {
                date: 2016,
                text: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11',
            },
            {
                date: 2017,
                text: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi'
            }
        ]
    },
    {
        text: 'Кино3',
        startingDate: 2016,
        endingDate: 2019,
        dates: [
            {
                date: 2016,
                text: '13 сентября — частное солнечное затмение,eqw видимое в Южной Африке и части Антарктиды'
            },
            {
                date: 2017,
                text: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11',
            },
            {
                date: 2018,
                text: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi'
            },
            {
                date: 2019,
                text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
            },
            {
                date: 2019,
                text: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11',
            },
            {
                date: 2019,
                text: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi'
            }
        ]
    },
    {
        text: 'Кино4',
        startingDate: 2016,
        endingDate: 2019,
        dates: [
            {
                date: 2016,
                text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
            },
            {
                date: 2017,
                text: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11',
            },
            {
                date: 2018,
                text: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi'
            },
            {
                date: 2019,
                text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
            },
            {
                date: 2019,
                text: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11',
            },
            {
                date: 2019,
                text: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi'
            }
        ]
    }
]

export type TPoint = {
    text: string;
    startingDate: number;
    endingDate: number;
    dates: Array<TDate>
}

export type TDate = {
    date: number;
    text: string
}